|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [ ]:
import pandas as pd

In [4]:
# Read data and describe it

import pandas as pd
df=pd.read_csv(r'C:\Users\Madhu\titanic_dataset.csv')
print(df.describe(include = 'all'))

         Unnamed: 0       pclass     survived                  name gender  \
count   1309.000000  1309.000000  1309.000000                  1309   1309
unique          NaN          NaN          NaN                  1307      2
top             NaN          NaN          NaN  Connolly, Miss. Kate   male
freq            NaN          NaN          NaN                     2    843
mean     654.000000     2.294882     0.381971                   NaN    NaN
std      378.020061     0.837836     0.486055                   NaN    NaN
min        0.000000     1.000000     0.000000                   NaN    NaN
25%      327.000000     2.000000     0.000000                   NaN    NaN
50%      654.000000     3.000000     0.000000                   NaN    NaN
75%      981.000000     3.000000     1.000000                   NaN    NaN
max     1308.000000     3.000000     1.000000                   NaN    NaN

                age        sibsp        parch    ticket    fare        cabin  \
count   1046.000000  1309.000000  1309.000000      1309    1308          295
unique          NaN          NaN          NaN       929     263          186
top             NaN          NaN          NaN  CA. 2343  $8.05   C23 C25 C27
freq            NaN          NaN          NaN        11      60            6
mean      29.881135     0.498854     0.385027       NaN     NaN          NaN
std       14.413500     1.041658     0.865560       NaN     NaN          NaN
min        0.166700     0.000000     0.000000       NaN     NaN          NaN
25%       21.000000     0.000000     0.000000       NaN     NaN          NaN
50%       28.000000     0.000000     0.000000       NaN     NaN          NaN
75%       39.000000     1.000000     0.000000       NaN     NaN          NaN
max       80.000000     8.000000     9.000000       NaN     NaN          NaN

       embarked boat        body     home.dest
count      1307  486  121.000000           745
unique        3   27         NaN           369
top           S   13         NaN  New York, NY
freq        914   39         NaN            64
mean        NaN  NaN  160.809917           NaN
std         NaN  NaN   97.696922           NaN
min         NaN  NaN    1.000000           NaN
25%         NaN  NaN   72.000000           NaN
50%         NaN  NaN  155.000000           NaN
75%         NaN  NaN  256.000000           NaN
max         NaN  NaN  328.000000           NaN

In [6]:
# Find columns with missingdata

print(df.isna().any())
print(df.columns[df.isna().any() == True])

Unnamed: 0    False
pclass        False
survived      False
name          False
gender        False
age            True
sibsp         False
parch         False
ticket        False
fare           True
cabin          True
embarked       True
boat           True
body           True
home.dest      True
dtype: bool
Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

In [9]:
# Print shape of dataset

print(df.shape)

(1309, 15)

In [13]:
# Drop columns with more than 25% missing data

# a=len(df)
# print(a)
t = len(df) * .75
m=df.dropna( axis = 'columns',thresh=t )
print(m)

      Unnamed: 0  pclass  survived  \
0              0       1         1
1              1       1         1
2              2       1         0
3              3       1         0
4              4       1         0
...          ...     ...       ...
1304        1304       3         0
1305        1305       3         0
1306        1306       3         0
1307        1307       3         0
1308        1308       3         0

                                                 name  gender      age  sibsp  \
0                       Allen, Miss. Elisabeth Walton  female  29.0000      0
1                      Allison, Master. Hudson Trevor    male   0.9167      1
2                        Allison, Miss. Helen Loraine  female   2.0000      1
3                Allison, Mr. Hudson Joshua Creighton    male  30.0000      1
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0000      1
...                                               ...     ...      ...    ...
1304                             Zabour, Miss. Hileni  female  14.5000      1
1305                            Zabour, Miss. Thamine  female      NaN      1
1306                        Zakarian, Mr. Mapriededer    male  26.5000      0
1307                              Zakarian, Mr. Ortin    male  27.0000      0
1308                               Zimmerman, Mr. Leo    male  29.0000      0

      parch  ticket      fare embarked
0         0   24160  $211.34         S
1         2  113781  $151.55         S
2         2  113781  $151.55         S
3         2  113781  $151.55         S
4         2  113781  $151.55         S
...     ...     ...       ...      ...
1304      0    2665   $14.45         C
1305      0    2665   $14.45         C
1306      0    2656    $7.23         C
1307      0    2670    $7.23         C
1308      0  315082    $7.88         S

[1309 rows x 11 columns]

In [56]:
# drop columns having independent values(which do not affect the survival rate).

# df.drop(columns = ['Unnamed: 0','name', 'ticket'], inplace = True)
# print(df.head(2))
# m.drop(columns=  ['Unnamed: 0','name', 'ticket'], inplace=True)
# print(m.head(2))

In [34]:
# check data types of all columns

print(df.dtypes)

pclass         int64
survived       int64
gender        object
age          float64
sibsp          int64
parch          int64
fare          object
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [35]:
# convert price to numeric

df.fare.replace(r'\$', '', regex = True, inplace = True)
print(df.head())
df.fare = df.fare.astype('float64')
print(df.dtypes)

   pclass  survived  gender      age  sibsp  parch     fare    cabin embarked  \
0       1         1  female  29.0000      0      0  211.34        B5        S
1       1         1    male   0.9167      1      2  151.55   C22 C26        S
2       1         0  female   2.0000      1      2  151.55   C22 C26        S
3       1         0    male  30.0000      1      2  151.55   C22 C26        S
4       1         0  female  25.0000      1      2  151.55   C22 C26        S

  boat   body                        home.dest
0    2    NaN                     St Louis, MO
1   11    NaN  Montreal, PQ / Chesterville, ON
2  NaN    NaN  Montreal, PQ / Chesterville, ON
3  NaN  135.0  Montreal, PQ / Chesterville, ON
4  NaN    NaN  Montreal, PQ / Chesterville, ON
pclass         int64
survived       int64
gender        object
age          float64
sibsp          int64
parch          int64
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [36]:
# find columns still having missing/na values and also count of missing data

print(df.isna().any())
print(df.isna().sum())

pclass       False
survived     False
gender       False
age           True
sibsp        False
parch        False
fare          True
cabin         True
embarked      True
boat          True
body          True
home.dest     True
dtype: bool
pclass          0
survived        0
gender          0
age           263
sibsp           0
parch           0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [37]:
# fill na with mean for fare and age column column.

df.fare.fillna(df.fare.mean(), inplace=True)
df.age.fillna(df.age.mean(), inplace = True)
print(df.isna().sum())

pclass          0
survived        0
gender          0
age             0
sibsp           0
parch           0
fare            0
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [38]:
# drop na values for embarked column.

df.dropna(subset=['embarked'],inplace=True)

None

In [39]:
# dump the dataframe to a csv file 'titanic_filtered.csv'.

df.to_csv('titanic_filtered.csv')

None

In [40]:
# for surviced column replace 0 with D and 1 with A

df.survived.replace({0:'D', 1:'A'}, inplace = True)
print(df.survived.head())

0    A
1    A
2    D
3    D
4    D
Name: survived, dtype: object

In [41]:
# find the frequency of different values in survived column

print( df.survived.value_counts() )

D    809
A    498
Name: survived, dtype: int64

In [44]:
# group by gender and survived and see the counts in each category

r=df.groupby(['gender','survived'])
r.count()

                 pclass  age  sibsp  parch  fare  cabin  embarked  boat  body  \
gender survived
female A            337  337    337    337   337    131       337   316     0
       D            127  127    127    127   127      8       127     1     8
male   A            161  161    161    161   161     60       161   159     0
       D            682  682    682    682   682     94       682     8   113

                 home.dest
gender survived
female A               240
       D                47
male   A               106
       D               351

In [47]:
# find different pclass and no of people in each class

print(df.pclass.unique())
print(df.pclass.value_counts())

[1 2 3]
3    709
1    321
2    277
Name: pclass, dtype: int64

In [48]:
# find top 5 people with highest values of age. Count no of male and females in the top 5

top=df.nlargest(5, 'age') 
print(top)
print(top.gender.value_counts())

      pclass survived  gender   age  sibsp  parch   fare cabin embarked boat  \
14         1        A    male  80.0      0      0  30.00   A23        S    B
61         1        A  female  76.0      1      0  78.85   C46        S    6
1235       3        D    male  74.0      0      0   7.78   NaN        S  NaN
9          1        D    male  71.0      0      0  49.50   NaN        C  NaN
135        1        D    male  71.0      0      0  34.65    A5        C  NaN

      body                home.dest
14     NaN            Hessle, Yorks
61     NaN  Little Onn Hall, Staffs
1235   NaN                      NaN
9     22.0      Montevideo, Uruguay
135    NaN             New York, NY
male      4
female    1
Name: gender, dtype: int64

In [49]:
# find max age male and female who survived

res= df[(df.survived=='A')& (df.gender=='male')]
print(res.nlargest(1, 'age') )

res= df[(df.survived=='A')& (df.gender=='female')]
print(res.nlargest(1, 'age') )

    pclass survived gender   age  sibsp  parch  fare cabin embarked boat  \
14       1        A   male  80.0      0      0  30.0   A23        S    B

    body      home.dest
14   NaN  Hessle, Yorks
    pclass survived  gender   age  sibsp  parch   fare cabin embarked boat  \
61       1        A  female  76.0      1      0  78.85   C46        S    6

    body                home.dest
61   NaN  Little Onn Hall, Staffs

In [52]:
# get average age by gender

print(df.groupby('gender').age.mean())

gender
female    28.795931
male      30.430716
Name: age, dtype: float64

In [53]:
# get average age by people survived vs not-survived

print(df.groupby('survived').age.mean())

survived
A    28.974711
D    30.389368
Name: age, dtype: float64